//2.获取一个数二进制序列中所有的偶数位和奇数位，分别输出其奇数和偶数的二进制序列。
//例如：20的二进制序列00000000000000000000000000010100
//偶数序列为：0000000000000000
//奇数序列为：0000000000000110
//【解题思路】：要得到偶数序列，先将每个偶数位移到最后一位，然后按位与1，就得到了这一位；要得到奇数序列，先将每个奇数位移到最后一位，然后按位与1，
//就得到了这一位。一个数按位与1，结果为0，那个数就是0；结果为1，那个数就是1.
#include <stdio.h>
#include <stdlib.h>


int main() {
	int num = 10;
	printf("奇数位: ");
	for (int i = 31; i >= 0; i -= 2) {

		printf("%d ", (num >> i) & 1);
	}
	printf("\n");
	printf("偶数位: ");

	for (int j = 32; j >= 1; j -= 2) {

		printf("%d ", (num >> j) & 1);
	}
	system("pause");
	return 0;
}