//********************数组************************
//1.数组创建和初始化
//数组创建:[]中要给常量才可以,不能使用变量
//   //常量的表达形式
//   //1.字面值常量
//	//2.const 修饰的常量
//	//3.enum 枚举
//	//4.#define 宏
//1.字面值常量
//#include <stdio.h>
//#include <stdlib.h>
//
//int main(){
//	// 字面值常量 10
//	int arr[10] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
//	for (int i = 0; i <= 9; i++){
//		printf("%d\n",arr[i]);
//	}
//	system("pause");
//	return 0;
//}
//****************************************************************************************
//3.enum 枚举
//#include <stdio.h>
//#include <stdlib.h>
////enum 枚举
//enum  {
//	SIZE=10 ,
//};
//
//int main(){
//	
//	int arr[SIZE] = {0,1,2,3,4,5,6,7,8,9};
//	for (int i = 0; i <= 9; i++){
//		printf("%d\n",arr[i]);
//	}
//	system("pause");
//	return 0;
//}
//****************************************************************************************
//4.#define 宏
//#include <stdio.h>
//#include <stdlib.h>
//
//#define A 10
//int main(){
//	 int arr[A] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
//	 for (int i = 0; i <= 9; i++){
//		 printf("%d\n",arr[i]);
//	 }
//	 system("pause");
//	 return 0;
//}
//****************************************************************************************
//2.const 修饰的常量(这块定义常量是不成立的)
//#include <stdio.h>
//#include <stdlib.h>
//
//int main(){
//	const int a = 10;
//	int arr[a] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
//	for (int i = 0; i <= 9; i++){
//		printf("%d\n",arr[i]);
//	}
//	system("pause");
//	return 0;
//}
//****************************************************************************************
//数组的初始化和赋值
//初始化:在创建变量的时候,去设定数值.int arr[10]={0}; 
//赋值:变量已经创建完了,再去设定数值.
//普通数组只能使用{}进行初始化,字符数组除了使用{},还可以使用""进行初始化,这时类似于一个字符串
//字符串一定是以\0结尾的,计算长度是遇到\0就结束(不计算\0).strlen
//字符数组计算长度(占内存的字节数):算\0
//1.strlen函数
//#include <stdio.h>
//#include <stdlib.h>
//
//int main(){
//	char arr1[] = {'a','b','c'};
//	char arr2[] = "abc";
//	printf("%d\n", strlen(arr1));//15结果错误,因为数组中不清楚\0到底在哪个位置,出现未定义行为
//	printf("%d\n", strlen(arr2));//3
//	system("pause");
//	return 0;
//}
//printf("%d\n", strlen(arr1));这个情况属于未定行为.因为无法找到下标为\0的
//****************************************************************************************
//2.sizeof函数
#include <stdio.h>
#include <stdlib.h>

int main(){
	char arr1[] = {'a','b','c'};
	char arr2[] = "abc";
	printf("%d\n",sizeof(arr1));//3
	printf("%d\n",sizeof(arr2));//4必须算上\0字符串都是以\0结束的
	system("pause");
	return 0;
}
//未定义行为:数组下标越界只是未定义行为中的一种情况.