//短路求值:对于逻辑与来说,如果左侧表达式的值已经是假,此时整个表达式的值就已经确定了,右侧不需要求值
//        对于逻辑或来说,如果左侧表达式的值已经是真,此时整个表达式的值就已经确定了,右侧不需要求值
#include <stdio.h>
#include <stdlib.h>

int main () {
	int i = 0, a = 0, b = 2, c = 3, d = 4;
	//i = a++ && ++b && c++ && d++; //左边表达式的值(自增之前的结果是0)
	//printf("a = %d\nb = %d\nc = %d\nd = %d\n ",a,b,c,d); //1 2 3 4 (对于逻辑与:只要满足一个等式是假的,那么后面的表达试就不用进行计算,等于表达式的值都是假的)
	i = a++ || ++b || c++ || d++;
	printf("a = %d\nb = %d\nc = %d\nd = %d\n ", a, b, c, d); //1 3 3 4 (对于逻辑或:只要满足一个等式是真的,那么后面的表达式的值不用计算,整个表达式的值就是真的)

    system ("pause");
    return 0;
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//关于前置++后置++前置--后置--的使用

//#include <stdio.h>
//#include <stdlib.h>
//
//int main () {
//	int  i = 0;
//	int a = 1;
//	//前置++:
//	//i = ++a;//(表达式的值等于自加之后的值)
//	//printf("i = %d\na = %d\n",i,a); //2 2
//	//后置++:
//	//i = a++; //(表达式的值等于自加之前的值)
//	//printf("i = %d\na = %d\n", i, a); //1 2
//	//前置--
//	//i = --a;
//	//printf("i = %d\na = %d\n", i, a);//0 0
//	//后置--
//	i = a--;
//	printf("i = %d\na = %d\n", i, a);//1 0
//
//    system ("pause");
//    return 0;
//}