//**笔试题**判定该程序要循环几次**
//#include<stdio.h>
//#include <stdlib.h>
//
//int main(){
//	int i = 0;
//	int k = 0;
//	//k=0这块属于表达式2，条件判定部分。当k=0是属于赋值,因此这块无法执行
//	for (i = 0, k = 0; k = 0; i++, k++){
//		k++;
//		printf("hehe\n");
//	}
//	system("pause");
//	return 0;
//}
////结果：0次循环
//************************************************************************
#include<stdio.h>
#include <stdlib.h>

int main(){
	int i = 0;
	int k = 0;
	//k == 0时为条件成立时，因此表达式执行
	for (i = 0, k = 0; k == 0; i++, k++){
		k++;
		printf("hehe\n");
	}
	system("pause");
	return 0;
}
////结果：1次循环
//************************************************************************