//************************操作符详解*************************
//*********1.算术运算符*********
//+  -  * /  % (取余数/求模)
//1.整数除以整数,结果还是整数,不存在四舍五入:
//举例:
//#include<stdio.h>
//#include <stdlib.h>
//
//int main(){
//	int a = 10;
//	int b = 20;
//	printf("%d\n",a/b);
//	system("pause");
//	return 0;
//}
//结果是0;因为整数除以整数仍然是整数,小数部分直接省略
//************************************************************************************
//2.隐式类型转化
//#include<stdio.h>
//#include <stdlib.h>
//
//int main(){
//	double a = 10.0;
//	int b = 20;
//	printf("%f\n",a/b);
//	system("pause");
//	return 0;
//}
//结果是0.500000
//隐式类型转化规则:表示数据范围小的往数据往数据范围大的类型去转化.
//***************************************************************************************
//3.显式类型转化(强制类型转化)
//#include<stdio.h>
//#include <stdlib.h>
//
//int main(){
//	int a = 10;
//	int b = 20;
//	printf("%f\n",(double)a/b);
//	system("pause");
//	return 0;
//}
//结果为0.500000
//强制类型转化也有可能丢掉小数部分数据(例如把大范围的数据强制转向小范围的数据)
//****************************************************************************************
// **整数 / 0得到的结果:**
//运行时,CPU在执行这一过程(整数 / 0)的时候会导致操作系统触发异常,然后给当前进程发送一个信号,导致进程异常终止.
//在C语言中,%操作只能针对整数进行计算.JAVA中可以进行浮点型计算
//#include <stdio.h>
//#include<stdlib.h>
//
//int main(){
//	int a = 10;
//	int b = 20;
//	printf("%d\n",a%b);
//	system("pause");
//	return 0;
//}
//结果是10
//**************************************************************************************
//*********2.移位运算符*********
//左移:   <<   左移一位类似于乘以2
//右移:   >>   右移一位(算术右移)类似除以2
//#include<stdio.h>
//#include <stdlib.h>
//
//int main(){
//	int num = 10;
//	num = num << 1;
//	printf("%d\n",num);
//	system("pause");
//	return 0;
//}
//结果20        左移一位类似于乘以2
//***********************************************************************************
//#include<stdio.h>
//#include <stdlib.h>
//
//int main(){
//	int num = 10;
//	num = num >> 1;
//	printf("%d\n", num);
//	system("pause");
//	return 0;
//}
//结果是5       右移一位(算术右移)类似除以2
//右移: 1.逻辑右移,最高位直接补0   2.算术右移,最高位补符号位
//***************************************************************************************
//警告:对于移位运算符,不要移动负数,这个是标准的未定行为
//*********3.位操作符*********
//  &  按位与  |  按位或   ^  按位异或   ~  按位取反
//////////////////////////////////////////////////////////
//  &  按位与        对应进行计算时,如果都为1,结果为1.否则为0.
//  |  按位或        对应进行计算时,如果都为0,结果为0.否则为1.
//  ^  按位异或      对应进行计算时,如果两个数字相同为0,不同为1.
//  ~  按位取反      针对当前操作数,遇到1就得到0,遇到0就得到1.
//**位操作符:针对数字转化成二进制之后,看对应的位进行计算
#include<stdio.h>
#include <stdlib.h>

int main(){
	int a = 10;   //10的二进制: 0000 0000 0000 0000 0000 0000 0000 1010
	int b = 20;   //20的二进制: 0000 0000 0000 0000 0000 0000 ‭0001 0100‬
	printf("%d\n",a&b);//结果是0 
	printf("%d\n", a|b);//结果是30        0001 1110
	printf("%d\n", a ^ b);//结果是 30     0001 1110
	printf("%x\n", ~a );//  按照十六进制进行打印ffff fff5     1111 1111 1111 1111 1111 1111 1111 0101
	system("pause");
	return 0;
}














