//**************数组的简单使用**********************
//一维数组的使用:
//例1.打印一组数字
//#include <stdio.h>
//#include <stdlib.h>
//
//int main(){
//	int arr[] = { 1, 2, 3, 4 };
//	for (int i = 0; i < 4; i++){
//		printf("%d\n",arr[i]);
//	}
//	system("pause");
//	return 0;
//}
//***************************************************************************************
//一维数组在内存中的使用:
#include <stdio.h>
#include <stdlib.h>

int main(){
	int arr[] = { 1, 2, 3, 4 };
	for (int i = 0; i < 4; i++){
		printf("%p\n",&arr[i]);//每一个地址大小相差4
	}
	system("pause");
	return 0;
}
//**************************************************************************************
//*************************************************************************************
//二维数组:
//二维数组的创建和初始化
//数组在定义的时候永远只有第一个[]的可以省略 ,第二个一定不能省略 int[][4]
//例1.打印一个二维数组
//#include <stdio.h>
//#include <stdlib.h>
//
//int main(){
//	      //长度为3的一维数组,每个元素的长度为4
//	int arr[3][4] = { 
//	{ 1, 2, 3, 4 },
//	{ 5, 6, 7, 8 },
//	{ 9, 10, 11, 12 }, 
//	};
//	for (int i = 0; i < 3; i++){
//		for (int j = 0; j < 4; j++){
//			printf("%d",arr[i][j]);
//			printf(" ");
//		}
//		printf("\n");
//	}
//	system("pause");
//	return 0;
//}
//*************************************************************************************
//#include <stdio.h>
//#include <stdlib.h>
//
//int main(){
//	int arr[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
//		for (int i = 0; i < 3; i++){
//			for (int j = 0; j < 4; j++){
//				printf("%d",arr[i][j]);
//				printf(" ");
//			}
//			printf("\n");
//		}
//		system("pause");
//		return 0;
//}
//**********************************************************************************
//逗号表达式:结果就是最后一个元素的值
//int a=(1,2)   a的结果为2
//**********************************************************************************
//数组作为函数参数时会隐试转化成指针
//例1,计算数组的字符长度
//#include<stdio.h>
//#include<stdlib.h>
//#include <string.h>
// 
////使用void ,不会存在返回值,直接打印
// void  Func(int arr[]){
//		printf("%d\n", sizeof(arr) / sizeof(arr[0]));//结果是1 因为数组在作为参数时会隐式转化成指针,指向首元素的地址
//	}
//int main(){
//	int arr[4] = { 9, 7, 2, 5 };
//	printf("%d\n", sizeof(arr) / sizeof(arr[0]));//结果是4 
//	Func(arr);
//	system("pause");
//	return 0;
//}
//************************************************************************************
//二维数组的使用:
//#include <stdio.h>
//#include <stdlib.h>
//#include <string.h>
//
//int main(){
//	int arr[3][4] = {0};
//	int i;
//	int j;
//	for (i = 0; i < 3; i++){
//		for (j = 0; j < 4; j++){
//			arr[i][j] = i * 4 + j;
//		}
//	}
//		for (i = 0; i < 3; i++){
//			for (j = 0; j < 4; j++){
//				printf("%d",arr[i][j]);
//				printf(" ");
//			}
//			printf("\n");
//	}
//	system("pause");
//	return 0;
//}
//************************************************************************************
//#include <stdio.h>
//#include <stdlib.h>
//#include <string.h>
//
//int main(){
//	int arr[3][4] = {0};
//	int i;
//	int j;
//	for (i = 0; i < 3; i++){
//		for (j = 0; j < 4; j++){
//			arr[i][j] = i * 4 + j;
//			printf("%d", arr[i][j]);
//			printf(" ");
//		}
//		printf("\n");
//	}
//	system("pause");
//	return 0;
//}
//************************************************************************************